IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_RCM_TOP_RCM.xml
<module name="TOP_RCM_TOP_RCM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_RCM_PID" acronym="TOP_RCM_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_WARM_RESET_CONFIG" acronym="TOP_RCM_WARM_RESET_CONFIG" offset="0x4" width="32" description="">
		<bitfield id="WDOG3_RST_EN" width="3" begin="30" end="28" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog control on Warm reset Write 3'b111 enable corresponding Watchdog to control Warm reset" range="30 - 28" rwaccess="RW"/> 
		<bitfield id="WDOG2_RST_EN" width="3" begin="26" end="24" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog control on Warm reset Write 3'b111 enable corresponding Watchdog to control Warm reset" range="26 - 24" rwaccess="RW"/> 
		<bitfield id="WDOG1_RST_EN" width="3" begin="22" end="20" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog control on Warm reset Write 3'b111 enable corresponding Watchdog to control Warm reset" range="22 - 20" rwaccess="RW"/> 
		<bitfield id="WDOG0_RST_EN" width="3" begin="18" end="16" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable corresponding Watchdog control on Warm reset Write 3'b111 enable corresponding Watchdog to control Warm reset" range="18 - 16" rwaccess="RW"/> 
		<bitfield id="TSENSE1_RST_EN" width="3" begin="14" end="12" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable temperature sensor 1 on Warm reset Write 3'b111 to enable temperature sensor 1l on Warm reset" range="14 - 12" rwaccess="RW"/> 
		<bitfield id="TSENSE0_RST_EN" width="3" begin="10" end="8" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable temperature sensor 0 control on Warm reset Write 3'b111 to enable temperature sensor 0 control on Warm reset" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="DEBUGSS_RST_EN" width="3" begin="6" end="4" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to disable debugger control on Warm reset Write 3'b111 enable debugger to control Warm reset" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="PAD_BYPASS" width="3" begin="2" end="0" resetval="0x7" description="Bypass the Warm reset from Pad InputData should be loaded as multibit.  Write 3'b000 : Pad Warm Reset pin has control over  warm resetWrite 3'b111 : Pad warm reset pin has no control on warm reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_WARM_RESET_REQ" acronym="TOP_RCM_WARM_RESET_REQ" offset="0x8" width="8" description="">
		<bitfield id="SW_RST" width="3" begin="2" end="0" resetval="0x7" description="Data should be loaded as multibit.  Write 3'b000 to assert warm reset from SWWrite 3'b111 to deassert warm reset from SW if this is the only source of warm reset" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_WARM_RST_CAUSE" acronym="TOP_RCM_WARM_RST_CAUSE" offset="0xC" width="16" description="">
		<bitfield id="CAUSE" width="12" begin="11" end="0" resetval="0x65" description="System Reset Cause register12'b0000_0100_0001 - POR reset12'b0000_0100_0010 - Warm reset due to MSS_WDT012'b0000_0100_0100 - Warm reset due to MSS_WDT112'b0000_0100_1000 - Warm reset due to MSS_WDT212'b0000_0101_0000 - Warm reset due to MSS_WDT312'b0000_0110_0000 - Warm reset due to TOP_RMC:WARM_RESET_REQ12'b0000_0100_0000 - External Pad reset12'b0000_1100_0000 - Warm reset due to HSM_WDT12'b0001_0100_0000 - Warm Reset due to Deugger reset12'b0010_0100_0000 - Warm Reset due to Temp Sense0 Reset12'b0100_0100_0000 - Warm Reset due to Temp Sense1 Reset" range="11 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_WARM_RST_CAUSE_CLR" acronym="TOP_RCM_WARM_RST_CAUSE_CLR" offset="0x10" width="8" description="">
		<bitfield id="CLEAR" width="3" begin="2" end="0" resetval="0x0" description="Write pulse bit field: Data should be loaded as multibit. System Reset Cause register Clear" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_RCOSC32K_CTRL" acronym="TOP_RCM_RCOSC32K_CTRL" offset="0x14" width="8" description="">
		<bitfield id="STOPOSC" width="3" begin="2" end="0" resetval="0x0" description="Stop 32KHz RCOSC. Write 3'b111 to stop clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_LIMP_MODE_EN" acronym="TOP_RCM_LIMP_MODE_EN" offset="0x18" width="16" description="">
		<bitfield id="COREPLL_LOSS_EN" width="3" begin="10" end="8" resetval="0x0" description="Enable for core pll phase lock loss to generate Limp mode3'b000: will not generate Limp mode (multibit 000)3'b111 :  will generate Limp mode (multibit 111)" range="10 - 8" rwaccess="RW"/> 
		<bitfield id="XTALCLK_LOSS_EN" width="3" begin="6" end="4" resetval="0x0" description="Enable for crystal_clock_loss to generate Limp mode3'b000: will not generate Limp mode (multibit 000)3'b111 :  will generate Limp mode (multibit 111)" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="DCC0_ERROR_EN" width="3" begin="2" end="0" resetval="0x0" description="Enable DCC0 Error to generate Limp mode 3'b000: DCC0 Error will not generate Limp mode (multibit 000)3'b111 : DCC0 Error will generate Limp mode (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_REF_CLK_SRC_SEL" acronym="TOP_RCM_PLL_REF_CLK_SRC_SEL" offset="0x1C" width="8" description="">
		<bitfield id="PLL_PERI_REF_CLK_SRC_SEL" width="3" begin="6" end="4" resetval="0x0" description="Mux selct for PERI PLL REF clockWrite 3'b111 :  to select external reference clock as PLL reference clockWrite 3'b000 :  to select on-die clock as PLL reference clock" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="PLL_CORE_REF_CLK_SRC_SEL" width="3" begin="2" end="0" resetval="0x0" description="Mux selct for CORE PLL REF clockWrite 3'b111 :  to select external reference clock as PLL reference clockWrite 3'b000 :  to select on-die clock as PLL reference clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PAD_XTAL_CTRL" acronym="TOP_RCM_PAD_XTAL_CTRL" offset="0x20" width="8" description="">
		<bitfield id="XTAL_XI_OE_N" width="1" begin="3" end="3" resetval="0x0" description="When gz is low, the padxo output is enabled, padxi to padxo is a single stage inverter, and the oscillator can oscillate with an external crystal plus capacitors/resistor.  When gz is high, padxo is in high impedance mode, padxi and Y are driven low, and the oscillator is disabled.  With gz high, the internal bias resistor between padxi and padxo is disconnected regardless of the state of resselect." range="3" rwaccess="RW"/> 
		<bitfield id="XTAL_XO_RESSELECT" width="1" begin="2" end="2" resetval="0x0" description="When resselect is low, an internal 1Meg Ohm resistor is connected between padxi and padxo for oscillator bias.      When resselect is asserted (high), the internal resistor is disconnected.      For oscillation with a crystal while resselect is high, an external resistor must be connected between padxi and padxo to provide bias." range="2" rwaccess="RW"/> 
		<bitfield id="XTAL_XO_SW2" width="1" begin="1" end="1" resetval="0x0" description="XTAL pad control bit frequency selection pin SW2 Based on table belowsw2 sw1 Freq of operation0 0 5     20 MHz0 1 15     35 MHz1 0 30     40 MHz1 1 40     55 MHz" range="1" rwaccess="RW"/> 
		<bitfield id="XTAL_XO_SW1" width="1" begin="0" end="0" resetval="0x1" description="XTAL pad control bit frequency selection pin SW1 Based on table belowsw2 sw1 Freq of operation0 0 5     20 MHz0 1 15     35 MHz1 0 30     40 MHz1 1 40     55 MHz" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_SOP_MODE_VALUE" acronym="TOP_RCM_SOP_MODE_VALUE" offset="0x24" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="See below table SOP_MODE values and its corresponding mappingSOP_PAD3    SOP_PAD2    SOP_PAD1    SOP_PAD0    bootmode       0                       0                      0                        0              QSPI Functional mode(4S)       0                       0                      0                        1              UART Functional mode         0                       0                      1                        0              QSPI Functional mode(1S)                      values from 3 to 7 is reserved for future use        1                       0                      0                        0              THB(test) mode       1                       0                      0                        1              ATPG mode       1                       0                      1                        0              FLED mode (Debug SoP mode)                     values from B to F is reserved for future use reset value of MMR is 0 but it will latch on to the SOP mode values after reset is released. when CPU reads the MMR it will show the latched SOP mode value only" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_CLK_LOSS_STATUS" acronym="TOP_RCM_CLK_LOSS_STATUS" offset="0x28" width="8" description="">
		<bitfield id="RC_GOOD_BOOT" width="1" begin="8" end="8" resetval="0x1" description="Clock status of RC clock at boot. Reset value will reflect the actual status1 --> clock present at boot0 --> clock not present at boot" range="8" rwaccess="RO"/> 
		<bitfield id="RC_CLOCK_LOSS" width="1" begin="4" end="4" resetval="0x0" description="Coarse detection clock loss status for RC clock. Reset value will reflect the actual status1 --> clock lost0 --> clock good" range="4" rwaccess="RO"/> 
		<bitfield id="CRYSTAL_CLOCK_LOSS" width="1" begin="0" end="0" resetval="0x0" description="Coarse detection clock loss status for Crystal clock. Reset value will reflect the actual status1 --> clock lost0 --> clock good" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_WARM_RSTTIME1" acronym="TOP_RCM_WARM_RSTTIME1" offset="0x30" width="16" description="">
		<bitfield id="DELAY" width="12" begin="11" end="0" resetval="0x2184" description="programing Output delay Data should be loaded as multibit.  For example: if value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_WARM_RSTTIME2" acronym="TOP_RCM_WARM_RSTTIME2" offset="0x34" width="16" description="">
		<bitfield id="DELAY" width="12" begin="11" end="0" resetval="0x2184" description="programing input Rise delay Data should be loaded as multibit.  For example: if value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_WARM_RSTTIME3" acronym="TOP_RCM_WARM_RSTTIME3" offset="0x38" width="16" description="">
		<bitfield id="DELAY" width="12" begin="11" end="0" resetval="0x273" description="programing Input Fall delay Data should be loaded as multibit.  For example: if value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_CORE_PWRCTRL" acronym="TOP_RCM_PLL_CORE_PWRCTRL" offset="0x400" width="8" description="">
		<bitfield id="PONIN" width="1" begin="5" end="5" resetval="0x1" description="ON/OFF control of the weak power switch digital. For functionalmode it should be 1" range="5" rwaccess="RW"/> 
		<bitfield id="PGOODIN" width="1" begin="4" end="4" resetval="0x1" description="ON/OFF control of the strong power switch digital. For functional mode it should be 1" range="4" rwaccess="RW"/> 
		<bitfield id="RET" width="1" begin="3" end="3" resetval="0x0" description="Save/Restore control for Retention mode. For functional mode itshould be 0" range="3" rwaccess="RW"/> 
		<bitfield id="ISORET" width="1" begin="2" end="2" resetval="0x0" description="Save/Restore control for Isolation of output pins For functional modeit should be 0" range="2" rwaccess="RW"/> 
		<bitfield id="ISOSCAN" width="1" begin="1" end="1" resetval="0x0" description="Save/Restore control for Isolation of the Scanout pins. For functionalmode it should be 0" range="1" rwaccess="RW"/> 
		<bitfield id="OFFMODE" width="1" begin="0" end="0" resetval="0x0" description="Used to switch OFF the logic on VDDA. For functional mode itshould be 0" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_CORE_CLKCTRL" acronym="TOP_RCM_PLL_CORE_CLKCTRL" offset="0x404" width="32" description="">
		<bitfield id="CYCLESLIPEN" width="1" begin="31" end="31" resetval="0x0" description="FailSafe enable to trigger re-calibration in case CycleSlip occurs between REFCLK and FBCLK." range="31" rwaccess="RW"/> 
		<bitfield id="ENSSC" width="1" begin="30" end="30" resetval="0x0" description="Controls Clock Spreading. SSC is not supported. Should be set to 0x0 to disable clock spreading." range="30" rwaccess="RW"/> 
		<bitfield id="CLKDCOLDOEN" width="1" begin="29" end="29" resetval="0x0" description="Synchronously enables/disables CLKDCOLDO0x0 : synchronously disables CLKDCOLDO0x1 : synchronously enables CLKDCOLDO" range="29" rwaccess="RW"/> 
		<bitfield id="IDLE" width="1" begin="23" end="23" resetval="0x1" description="Sets PLL to Idle mode0x0 : When SYSRESET = 0 and TINITZ = 1 IDLE = 0 PLL will go toActive and Locked0x1 : When SYSRESET = 0 and TINITZ = 1 IDLE = 1 PLL will go toIdle Bypass low powe" range="23" rwaccess="RW"/> 
		<bitfield id="BYPASSACKZ" width="1" begin="22" end="22" resetval="0x0" description="BYPASSACKZ is a special purpose input to the module. In generalthis input is expected to be tied to static low. For the output clocks ofthe module that do not have an internal bypass mux viz.CLKDCOLDO and CLKOUTLDO, a bypass mux could beimplemented external to the module." range="22" rwaccess="RW"/> 
		<bitfield id="STBYRET" width="1" begin="21" end="21" resetval="0x0" description="Standby retention control0x0 : prepares ADPLLLJ for relock when out of retention byremoving the gating on all internal clocks.0x1 : prepares ADPLLLJ for retention by gating all the internalclocks." range="21" rwaccess="RW"/> 
		<bitfield id="CLKOUTEN" width="1" begin="20" end="20" resetval="0x0" description="CLKOUT enable or disable0x0 : synchronously disables CLKOUT0x1 : synchronously enables CLKOUT" range="20" rwaccess="RW"/> 
		<bitfield id="CLKOUTLDOEN" width="1" begin="19" end="19" resetval="0x1" description="Synchronously enables/disables CLKOUTLDO 0x0 : synchronously disables CLKOUTLDO 0x1 : synchronously enables CLKOUTLDO" range="19" rwaccess="RW"/> 
		<bitfield id="ULOWCLKEN" width="1" begin="18" end="18" resetval="0x0" description="Select CLKOUT source in bypass0x0: When ADPLLLJ in bypass mode, CLKOUT = CLKINP/(N2+1)0x1: When ADPLLLJ in bypass mode, CLKOUT = CLKINPULOW." range="18" rwaccess="RW"/> 
		<bitfield id="CLKDCOLDOPWDNZ" width="1" begin="17" end="17" resetval="0x0" description="0 Asynchronous power down for CLKDCOLDO o/p." range="17" rwaccess="RW"/> 
		<bitfield id="M2PWDNZ" width="1" begin="16" end="16" resetval="0x1" description="M2 divider power down mode0x0: Asynchronous power down for M2 divider0x1 : M2 divider is functional" range="16" rwaccess="RW"/> 
		<bitfield id="STOPMODE" width="1" begin="14" end="14" resetval="0x1" description="When in Lossclk/Stbyret 0x0 : Limp mode 0x1 : Stopmode" range="14" rwaccess="RW"/> 
		<bitfield id="SELFREQDCO" width="3" begin="12" end="10" resetval="0x4" description="DCO Clock (DCOCLK = CLKINP * [M/(N+1)]) frequency rangeselector.0x0: Reserved0x2: HS2 : DCOCLK range is from 500 MHz to 1000 MHz0x3: Reserved0x4: HS1: DCOCLK range is from 1000 MHz to 2000 MHz0x5: Reserved" range="12 - 10" rwaccess="RW"/> 
		<bitfield id="RELAXED_LOCK" width="1" begin="8" end="8" resetval="0x0" description="Decides when FREQLOCK asserted0x0: FREQLOCK asserted when DC frequency error less than 1%0x1: FREQLOCK asserted when DC frequency error less than 2%" range="8" rwaccess="RW"/> 
		<bitfield id="SSCTYPE" width="1" begin="1" end="1" resetval="0x0" description="SSC Type" range="1" rwaccess="RW"/> 
		<bitfield id="TINTZ" width="1" begin="0" end="0" resetval="0x0" description="PLL core soft reset" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_CORE_TENABLE" acronym="TOP_RCM_PLL_CORE_TENABLE" offset="0x408" width="0" description="">
		<bitfield id="TENABLE" width="1" begin="0" end="0" resetval="0x0" description="M, N. SD and SELFREQDCO latch (active rise edge)" range="0" rwaccess="RW"/>
	</register>
