IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_RCM_TOP_RCM.xml
	<register id="TOP_RCM_PLL_CORE_HSDIVIDER_RSTCTRL" acronym="TOP_RCM_PLL_CORE_HSDIVIDER_RSTCTRL" offset="0x440" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the HSDIVIDERWrite 3'b111 : Override is enabled and Reset is asserted" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_R5SS_CLK_SRC_SEL" acronym="TOP_RCM_R5SS_CLK_SRC_SEL" offset="0x500" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS Coretex R5 and System bus Clock.Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_R5SS_CLK_STATUS" acronym="TOP_RCM_R5SS_CLK_STATUS" offset="0x504" width="8" description="">
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for Root clock for CortexR5 and Sysclk" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_R5SS0_CLK_DIV_SEL" acronym="TOP_RCM_R5SS0_CLK_DIV_SEL" offset="0x510" width="8" description="">
		<bitfield id="CLKDIVSEL" width="3" begin="2" end="0" resetval="0x0" description="writing 3'b000 Sets R5 clock = R5SS Root clockWriting 3'b111 Sets R5 Clock = SYSCLK" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_R5SS1_CLK_DIV_SEL" acronym="TOP_RCM_R5SS1_CLK_DIV_SEL" offset="0x514" width="8" description="">
		<bitfield id="CLKDIVSEL" width="3" begin="2" end="0" resetval="0x0" description="writing 3'b000 Sets R5 clock = R5SS Root clockWriting 3'b111 Sets R5 Clock = SYSCLK" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_R5SS0_CLK_GATE" acronym="TOP_RCM_R5SS0_CLK_GATE" offset="0x518" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS Coretex R5.Data should be loaded as multibit.  Write 3'b000 : Clock is ungated (multibit 000)Write 3'b111 : Clock is gated (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_R5SS1_CLK_GATE" acronym="TOP_RCM_R5SS1_CLK_GATE" offset="0x51C" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS Coretex R5.Data should be loaded as multibit.  Write 3'b000 : Clock is ungated (multibit 000)Write 3'b111 : Clock is gated (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_SYS_CLK_DIV_VAL" acronym="TOP_RCM_SYS_CLK_DIV_VAL" offset="0x520" width="16" description="">
		<bitfield id="CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for System Clock selected clock.Data should be loaded as multibit.  For example: if divider value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_SYS_CLK_GATE" acronym="TOP_RCM_SYS_CLK_GATE" offset="0x524" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  System ClockData should be loaded as multibit.  Write 3'b000 : Clock is ungated (multibit 000)Write 3'b111 : Clock is gated (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_SYS_CLK_STATUS" acronym="TOP_RCM_SYS_CLK_STATUS" offset="0x528" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for Sys Clock" range="15 - 8" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_PLL_PER_PWRCTRL" acronym="TOP_RCM_PLL_PER_PWRCTRL" offset="0x800" width="8" description="">
		<bitfield id="PONIN" width="1" begin="5" end="5" resetval="0x1" description="ON/OFF control of the weak power switch digital. For functionalmode it should be 1" range="5" rwaccess="RW"/> 
		<bitfield id="PGOODIN" width="1" begin="4" end="4" resetval="0x1" description="ON/OFF control of the strong power switch digital. For functional mode it should be 1" range="4" rwaccess="RW"/> 
		<bitfield id="RET" width="1" begin="3" end="3" resetval="0x0" description="Save/Restore control for Retention mode. For functional mode itshould be 0" range="3" rwaccess="RW"/> 
		<bitfield id="ISORET" width="1" begin="2" end="2" resetval="0x0" description="Save/Restore control for Isolation of output pins For functional modeit should be 0" range="2" rwaccess="RW"/> 
		<bitfield id="ISOSCAN" width="1" begin="1" end="1" resetval="0x0" description="Save/Restore control for Isolation of the Scanout pins. For functionalmode it should be 0" range="1" rwaccess="RW"/> 
		<bitfield id="OFFMODE" width="1" begin="0" end="0" resetval="0x0" description="Used to switch OFF the logic on VDDA. For functional mode itshould be 0" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_CLKCTRL" acronym="TOP_RCM_PLL_PER_CLKCTRL" offset="0x804" width="32" description="">
		<bitfield id="CYCLESLIPEN" width="1" begin="31" end="31" resetval="0x0" description="FailSafe enable to trigger re-calibration in case CycleSlip occurs between REFCLK and FBCLK." range="31" rwaccess="RW"/> 
		<bitfield id="ENSSC" width="1" begin="30" end="30" resetval="0x0" description="Controls Clock Spreading. SSC is not supported. Should be set to 0x0 to disable clock spreading." range="30" rwaccess="RW"/> 
		<bitfield id="CLKDCOLDOEN" width="1" begin="29" end="29" resetval="0x0" description="Synchronously enables/disables CLKDCOLDO0x0 : synchronously disables CLKDCOLDO0x1 : synchronously enables CLKDCOLDO" range="29" rwaccess="RW"/> 
		<bitfield id="IDLE" width="1" begin="23" end="23" resetval="0x1" description="Sets PLL to Idle mode0x0 : When SYSRESET = 0 and TINITZ = 1 IDLE = 0 PLL will go toActive and Locked0x1 : When SYSRESET = 0 and TINITZ = 1 IDLE = 1 PLL will go toIdle Bypass low powe" range="23" rwaccess="RW"/> 
		<bitfield id="BYPASSACKZ" width="1" begin="22" end="22" resetval="0x0" description="BYPASSACKZ is a special purpose input to the module. In generalthis input is expected to be tied to static low. For the output clocks ofthe module that do not have an internal bypass mux viz.CLKDCOLDO and CLKOUTLDO, a bypass mux could beimplemented external to the module." range="22" rwaccess="RW"/> 
		<bitfield id="STBYRET" width="1" begin="21" end="21" resetval="0x0" description="Standby retention control0x0 : prepares ADPLLLJ for relock when out of retention byremoving the gating on all internal clocks.0x1 : prepares ADPLLLJ for retention by gating all the internalclocks." range="21" rwaccess="RW"/> 
		<bitfield id="CLKOUTEN" width="1" begin="20" end="20" resetval="0x0" description="CLKOUT enable or disable0x0 : synchronously disables CLKOUT0x1 : synchronously enables CLKOUT" range="20" rwaccess="RW"/> 
		<bitfield id="CLKOUTLDOEN" width="1" begin="19" end="19" resetval="0x1" description="Synchronously enables/disables CLKOUTLDO 0x0 : synchronously disables CLKOUTLDO 0x1 : synchronously enables CLKOUTLDO" range="19" rwaccess="RW"/> 
		<bitfield id="ULOWCLKEN" width="1" begin="18" end="18" resetval="0x0" description="Select CLKOUT source in bypass0x0: When ADPLLLJ in bypass mode, CLKOUT = CLKINP/(N2+1)0x1: When ADPLLLJ in bypass mode, CLKOUT = CLKINPULOW." range="18" rwaccess="RW"/> 
		<bitfield id="CLKDCOLDOPWDNZ" width="1" begin="17" end="17" resetval="0x0" description="0 Asynchronous power down for CLKDCOLDO o/p." range="17" rwaccess="RW"/> 
		<bitfield id="M2PWDNZ" width="1" begin="16" end="16" resetval="0x1" description="M2 divider power down mode0x0: Asynchronous power down for M2 divider0x1 : M2 divider is functional" range="16" rwaccess="RW"/> 
		<bitfield id="STOPMODE" width="1" begin="14" end="14" resetval="0x1" description="When in Lossclk/Stbyret 0x0 : Limp mode 0x1 : Stopmode" range="14" rwaccess="RW"/> 
		<bitfield id="SELFREQDCO" width="3" begin="12" end="10" resetval="0x4" description="DCO Clock (DCOCLK = CLKINP * [M/(N+1)]) frequency rangeselector.0x0: Reserved0x2: HS2 : DCOCLK range is from 500 MHz to 1000 MHz0x3: Reserved0x4: HS1: DCOCLK range is from 1000 MHz to 2000 MHz0x5: Reserved" range="12 - 10" rwaccess="RW"/> 
		<bitfield id="RELAXED_LOCK" width="1" begin="8" end="8" resetval="0x0" description="Decides when FREQLOCK asserted0x0: FREQLOCK asserted when DC frequency error less than 1%0x1: FREQLOCK asserted when DC frequency error less than 2%" range="8" rwaccess="RW"/> 
		<bitfield id="SSCTYPE" width="1" begin="1" end="1" resetval="0x0" description="SSC Type" range="1" rwaccess="RW"/> 
		<bitfield id="TINTZ" width="1" begin="0" end="0" resetval="0x0" description="PLL core soft reset" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_TENABLE" acronym="TOP_RCM_PLL_PER_TENABLE" offset="0x808" width="0" description="">
		<bitfield id="TENABLE" width="1" begin="0" end="0" resetval="0x0" description="M, N. SD and SELFREQDCO latch (active rise edge)" range="0" rwaccess="RW"/>
	</register>
