IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_RCM_TOP_RCM.xml
	<register id="TOP_RCM_PLL_PER_TENABLEDIV" acronym="TOP_RCM_PLL_PER_TENABLEDIV" offset="0x80C" width="0" description="">
		<bitfield id="TENABLEDIV" width="1" begin="0" end="0" resetval="0x0" description="M2 and N2 latch (active rise edge)" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_M2NDIV" acronym="TOP_RCM_PLL_PER_M2NDIV" offset="0x810" width="24" description="">
		<bitfield id="M2" width="7" begin="22" end="16" resetval="0x0" description="Post-divider is REGM2" range="22 - 16" rwaccess="RW"/> 
		<bitfield id="N" width="8" begin="7" end="0" resetval="0x19" description="Pre-divider is REGN+1" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_MN2DIV" acronym="TOP_RCM_PLL_PER_MN2DIV" offset="0x814" width="24" description="">
		<bitfield id="N2" width="4" begin="19" end="16" resetval="0x0" description="Bypass divider is REGN2+1" range="19 - 16" rwaccess="RW"/> 
		<bitfield id="M" width="12" begin="11" end="0" resetval="0x1536" description="Feedback Multiplier is REGM" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_FRACDIV" acronym="TOP_RCM_PLL_PER_FRACDIV" offset="0x818" width="32" description="">
		<bitfield id="REGSD" width="8" begin="31" end="24" resetval="0x8" description="Sigma-Delta DividerShould be set by s/w to provide optimum jitter performance.DPLL_SD_DIV = CEILING ([DPLL_MULT/(DPLL_DIV+1)] * CLKINP/ 250), where CLKINP is the input clock of the DPLL in MHz" range="31 - 24" rwaccess="RW"/> 
		<bitfield id="FRACTIONALM" width="18" begin="17" end="0" resetval="0x0" description="Fractional part of the M divider." range="17 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_BWCTRL" acronym="TOP_RCM_PLL_PER_BWCTRL" offset="0x81C" width="8" description="">
		<bitfield id="BWCONTROL" width="2" begin="2" end="1" resetval="0x0" description="Change Loop Bandwidth" range="2 - 1" rwaccess="RW"/> 
		<bitfield id="BW_INCR_DECRZ" width="1" begin="0" end="0" resetval="0x0" description="Direction of Loop Bandwidth0x0 : decrease BW0x1 : increase BW" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_FRACCTRL" acronym="TOP_RCM_PLL_PER_FRACCTRL" offset="0x820" width="32" description="">
		<bitfield id="DOWNSPREAD" width="1" begin="31" end="31" resetval="0x0" description="Controls frequency spread0x0 : enables both side frequency spread about the programmed frequency.0x1 : enables low frequency spread only" range="31" rwaccess="RW"/> 
		<bitfield id="MODFREQDIVIDEREXPONENT" width="3" begin="30" end="28" resetval="0x0" description="Exponent of the REFCLK divider to define the modulation frequency." range="30 - 28" rwaccess="RW"/> 
		<bitfield id="MODFREQDIVIDERMANTISSA" width="7" begin="27" end="21" resetval="0x0" description="Mantissa of the REFCLK divider to define the modulation frequency" range="27 - 21" rwaccess="RW"/> 
		<bitfield id="DELTAMSTEPINTEGER" width="3" begin="20" end="18" resetval="0x0" description="Integer part of Frequency Spread control" range="20 - 18" rwaccess="RW"/> 
		<bitfield id="DELTAMSTEPFRACTION" width="18" begin="17" end="0" resetval="0x0" description="The fraction part of Frequency Spread control" range="17 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_STATUS" acronym="TOP_RCM_PLL_PER_STATUS" offset="0x824" width="32" description="">
		<bitfield id="PONOUT" width="1" begin="31" end="31" resetval="0x1" description="Status of the weak power-switch0x0 : indicates the/OFF status of the weak power-switch in digital toSOC.0x1 : ndicates the ON status of the weak power-switch in digital toSOC." range="31" rwaccess="RO"/> 
		<bitfield id="PGOODOUT" width="1" begin="30" end="30" resetval="0x1" description="Status of the strong power-switch0x0 : indicates the/OFF status of the strong power-switch in digital toSOC.0x1 : ndicates the ON status of the strong power-switch in digital toSOC." range="30" rwaccess="RO"/> 
		<bitfield id="LDOPWDN" width="1" begin="29" end="29" resetval="0x1" description="1 indicates ADPLLLJ internal LDO is power down. VDDLDOOUT willbe un-defined in this condition" range="29" rwaccess="RO"/> 
		<bitfield id="RECAL_BSTATUS3" width="1" begin="28" end="28" resetval="0x0" description="Recalibration status flag. 1 ADPLLLJ requires recalibration" range="28" rwaccess="RO"/> 
		<bitfield id="RECAL_OPPIN" width="1" begin="27" end="27" resetval="0x0" description="Recalibration status flag. 1 ADPLLLJ requires recalibration" range="27" rwaccess="RO"/> 
		<bitfield id="CLKOUTLDOENACK" width="1" begin="12" end="12" resetval="0x1" description="Indicates the enable/disable condition of CLKOUTLDOEN0x0 = CLKOUTLDO gating completed0x1 = CLKOUTLDO enabling completed" range="12" rwaccess="RO"/> 
		<bitfield id="CLKDCOLDOACK" width="1" begin="11" end="11" resetval="0x0" description="Indicates the enable/disable condition of CLKDCOLDOEN0x0 = CLKDCOLDO gating completed0x1 = CLKDCOLDO enabling completed" range="11" rwaccess="RO"/> 
		<bitfield id="PHASELOCK" width="1" begin="10" end="10" resetval="0x0" description="Status on PHASELOCK output pin" range="10" rwaccess="RO"/> 
		<bitfield id="FREQLOCK" width="1" begin="9" end="9" resetval="0x0" description="Status on FREQLOCK output pin" range="9" rwaccess="RO"/> 
		<bitfield id="BYPASSACK" width="1" begin="8" end="8" resetval="0x1" description="Status of BYPASSACK output pin" range="8" rwaccess="RO"/> 
		<bitfield id="STBYRETACK" width="1" begin="7" end="7" resetval="0x0" description="Standby and retention status0x0: indicates to SOC that all internal clocks in ADPLLLJ are activeand it is starting the relock process.0x1: indicates to SOC that all internal clocks in ADPLLLJ are gatedand it is ready for retention." range="7" rwaccess="RO"/> 
		<bitfield id="LOSSREF" width="1" begin="6" end="6" resetval="0x1" description="Reference input loss" range="6" rwaccess="RO"/> 
		<bitfield id="CLKOUTENACK" width="1" begin="5" end="5" resetval="0x0" description="Indicates the enable/disable condition of CLKOUTEN0x0 = CLKOUT gating completed0x1 = CLKOUT enabling completed" range="5" rwaccess="RO"/> 
		<bitfield id="LOCK2" width="1" begin="4" end="4" resetval="0x0" description="ADPLL internal loop lock status" range="4" rwaccess="RO"/> 
		<bitfield id="M2CHANGEACK" width="1" begin="3" end="3" resetval="0x0" description="Acknowledge for change to M2 divider. Toggles from 1-0 or 0-1(depending on current value) once CLKOUT frequency change hascompleted." range="3" rwaccess="RO"/> 
		<bitfield id="SSCACK" width="1" begin="2" end="2" resetval="0x0" description="Spread Spectrum status0x0 : Spread-spectrum Clocking is disabled on output clocks0x1 : Spread-spectrum Clocking is enabled on output clocks" range="2" rwaccess="RO"/> 
		<bitfield id="HIGHJITTER" width="1" begin="1" end="1" resetval="0x0" description="1 indicates jitter. After PHASELOCK is asserted high, theHIGHJITTER flag is asserted high if phase error between REFCLKand FBCLK greater than 24%." range="1" rwaccess="RO"/> 
		<bitfield id="BYPASS" width="1" begin="0" end="0" resetval="0x1" description="Bypass status signal. 1 CLKOUT in bypass" range="0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_PLL_PER_HSDIVIDER" acronym="TOP_RCM_PLL_PER_HSDIVIDER" offset="0x828" width="24" description="">
		<bitfield id="LDOPWDNACK" width="1" begin="17" end="17" resetval="0x0" description="LDO Power Down Ack" range="17" rwaccess="RO"/> 
		<bitfield id="BYPASSACKZ" width="1" begin="16" end="16" resetval="0x0" description="HSDIVIDER Bypass Ack" range="16" rwaccess="RO"/> 
		<bitfield id="TENABLEDIV" width="1" begin="2" end="2" resetval="0x0" description="Tenable Div" range="2" rwaccess="RW"/> 
		<bitfield id="LDOPWDN" width="1" begin="1" end="1" resetval="0x0" description="LDO Power Down" range="1" rwaccess="RW"/> 
		<bitfield id="BYPASS" width="1" begin="0" end="0" resetval="0x0" description="HSDIVIDER Bypass" range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT0" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT0" offset="0x82C" width="16" description="">
		<bitfield id="PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER M4 divider and hence CLKOUT0 output0h (R/W) = CLKOUT0 divider active1h (R/W) = CLKOUT0 divider is powered down" range="12" rwaccess="RW"/> 
		<bitfield id="STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT0 status0h (R) = The clock output is gated1h (R) = The clock output is enabled" range="9" rwaccess="RO"/> 
		<bitfield id="GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT00h (R/W) = Automatically gate this clock when there is nodependency for it1h (R/W) = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="RW"/> 
		<bitfield id="DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT0_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="RO"/> 
		<bitfield id="DIV" width="5" begin="4" end="0" resetval="0x11" description="DPLL post-divider factor, M4, for internal clock generation.Divide values from 1 to 31.0h (R/W) = Reserved" range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT1" acronym="TOP_RCM_PLL_PER_HSDIVIDER_CLKOUT1" offset="0x830" width="16" description="">
		<bitfield id="PWDN" width="1" begin="12" end="12" resetval="0x0" description="Power down for HSDIVIDER M5 divider and hence CLKOUT1 output0h (R/W) = CLKOUT1 divider active1h (R/W) = CLKOUT1 divider is powered down" range="12" rwaccess="RW"/> 
		<bitfield id="STATUS" width="1" begin="9" end="9" resetval="0x0" description="HSDIVIDER CLKOUT1 status0h (R) = The clock output is gated1h (R) = The clock output is enabled" range="9" rwaccess="RO"/> 
		<bitfield id="GATE_CTRL" width="1" begin="8" end="8" resetval="0x0" description="Control gating of HSDIVIDER CLKOUT10h (R/W) = Automatically gate this clock when there is nodependency for it1h (R/W) = Force this clock to stay enabled even if there is norequest" range="8" rwaccess="RW"/> 
		<bitfield id="DIVCHACK" width="1" begin="5" end="5" resetval="0x0" description="Toggle on this status bit after changing HSDIVIDER_CLKOUT1_DIVindicates that the change in divider value has taken effect" range="5" rwaccess="RO"/> 
		<bitfield id="DIV" width="5" begin="4" end="0" resetval="0x9" description="DPLL post-divider factor, M5, for internal clock generation.Divide values from 1 to 31.0h (R/W) = Reserved" range="4 - 0" rwaccess="RW"/>
	</register>
