IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_RCM_TOP_RCM.xml
	<register id="TOP_RCM_PLL_PER_RSTCTRL" acronym="TOP_RCM_PLL_PER_RSTCTRL" offset="0x83C" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the PLLWrite 3'b111 : Override is enabled and Reset is asserted" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_PLL_PER_HSDIVIDER_RSTCTRL" acronym="TOP_RCM_PLL_PER_HSDIVIDER_RSTCTRL" offset="0x840" width="8" description="">
		<bitfield id="ASSERT" width="3" begin="2" end="0" resetval="0x0" description="SW Reset override for the HSDIVIDERWrite 3'b111 : Override is enabled and Reset is asserted" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT0_CLK_SRC_SEL" acronym="TOP_RCM_CLKOUT0_CLK_SRC_SEL" offset="0xC00" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS CLKOUT .Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT1_CLK_SRC_SEL" acronym="TOP_RCM_CLKOUT1_CLK_SRC_SEL" offset="0xC04" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for MSS CLKOUT .Data should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT0_DIV_VAL" acronym="TOP_RCM_CLKOUT0_DIV_VAL" offset="0xC08" width="16" description="">
		<bitfield id="CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock.Data should be loaded as multibit.  For example: if divider value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT1_DIV_VAL" acronym="TOP_RCM_CLKOUT1_DIV_VAL" offset="0xC0C" width="16" description="">
		<bitfield id="CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for CLKOUT selected clock.Data should be loaded as multibit.  For example: if divider value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT0_CLK_GATE" acronym="TOP_RCM_CLKOUT0_CLK_GATE" offset="0xC10" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS CLKOUTData should be loaded as multibit.  Write 3'b000 : Clock is ungated (multibit 000)Write 3'b111 : Clock is gated (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT1_CLK_GATE" acronym="TOP_RCM_CLKOUT1_CLK_GATE" offset="0xC14" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="Only for debug- Functionality not guaranteed Clock gating config for  MSS CLKOUTData should be loaded as multibit.  Write 3'b000 : Clock is ungated (multibit 000)Write 3'b111 : Clock is gated (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_CLKOUT0_CLK_STATUS" acronym="TOP_RCM_CLKOUT0_CLK_STATUS" offset="0xC18" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CLKOUT Clock" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CLKOUT Clock" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_CLKOUT1_CLK_STATUS" acronym="TOP_RCM_CLKOUT1_CLK_STATUS" offset="0xC1C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for CLKOUT Clock" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for CLKOUT Clock" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_TRCCLKOUT_CLK_SRC_SEL" acronym="TOP_RCM_TRCCLKOUT_CLK_SRC_SEL" offset="0xC20" width="16" description="">
		<bitfield id="CLKSRCSEL" width="12" begin="11" end="0" resetval="0x0" description="Select line for selecting source clock for TRC ClkoutData should be loaded as multibit.  For example: if Clock source 0x5 should be selected then 0x555 should be configured to the register.Refer to AM602 clock spec for source clock reference" range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_TRCCLKOUT_DIV_VAL" acronym="TOP_RCM_TRCCLKOUT_DIV_VAL" offset="0xC24" width="16" description="">
		<bitfield id="CLKDIV" width="12" begin="11" end="0" resetval="0x0" description="Divider value for TRC Clkout selected clock.Data should be loaded as multibit.  For example: if divider value of 0x5 should be selected then 0x555 should be configured to the register." range="11 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_TRCCLKOUT_CLK_GATE" acronym="TOP_RCM_TRCCLKOUT_CLK_GATE" offset="0xC28" width="8" description="">
		<bitfield id="GATED" width="3" begin="2" end="0" resetval="0x0" description="Clock gatring config for TRC ClkoutData should be loaded as multibit.  Write 3'b000 : Clock is ungated (multibit 000)Write 3'b111 : Clock is gated (multibit 111)" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_RCM_TRCCLKOUT_CLK_STATUS" acronym="TOP_RCM_TRCCLKOUT_CLK_STATUS" offset="0xC2C" width="16" description="">
		<bitfield id="CURRDIVIDER" width="8" begin="15" end="8" resetval="0x0" description="Status shows the current divider value choosen for PMIC Clkout Clock" range="15 - 8" rwaccess="RO"/> 
		<bitfield id="CLKINUSE" width="8" begin="7" end="0" resetval="0x1" description="Status shows the source clock slected for PMIC Clkout Clock" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="TOP_RCM_DFT_DMLED_EXEC" acronym="TOP_RCM_DFT_DMLED_EXEC" offset="0xD00" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="SW mapping for DMLED ExecutionBit 0 : HSM CM4 Execution Bit 1 : HWA CM4 Execution Bit 2 : MSS CR5undefined Execution" range="31 - 0" rwaccess="RW"/>
	</register>
